# Урок 1. Ввод-Вывод, операторы ветвления
# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

def task_1():
    print('Задача 2')
    input_string = input('ВВедите трехзначное число: ')
    sum  = 0
    for i in input_string:
       sum += int(i)
    print(f"Сумма цифр рехзначного числа равна: {sum}")

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

def task_2():
    print('Задача 4')
    petya = int(input('Ведите сколько один из парней сделал журавликов: '))
    sergey = petya
    katya = (petya + sergey)*2
    sum = katya + petya + sergey
    print(f'{sum} -> {petya} {katya} {sergey} ')

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

def task_3():
    print('Задача 6')
    input_string = input('ВВедите номер билета : ')
    first = 0
    second = 0
    for i in input_string[0:3]:
        first+=int(i)
    for i in input_string[3:6]:
        second+=int(i)
    if first == second:
        print(f'{input_string} -> yes')
    else: 
        print(f'{input_string} -> no')

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

def task_4():
    print('Задача 8')
    n = int(input('ВВедите число n: '))
    m = int(input('ВВедите число m: '))
    k = int(input('ВВедите число k: '))
    # pieces = []
    # temp = 0
    # for i in range(n-1):
    #     temp = temp + m
    #     pieces.append(temp)
    # temp =0
    # for i in range(m-1):
    #     temp = temp + n
    #     pieces.append(temp)
    # if k not in pieces:
    #     print(f'{n} {m} {k} -> no')
    # else:
    #     print(f'{n} {m} {k} -> yes')
    if k % n == 0 or k % m == 0 and k < n * m:
        print(f'{n} {m} {k} -> yes')
    else:
        print(f'{n} {m} {k} -> no')
    

def main():
    # task_1()
    # task_2()
    # task_3()
    task_4()


if __name__ == '__main__':
    main()